src/Catalogs/КомментарииНеисправностей/КомментарииНеисправностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КомментарииНеисправностей</name>
  <attributes>
    <name>ИспользоватьПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.РабочиеМестаЛинеек</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonForms/ВыборПараметровРемонта/Module.bsl
&НаСервере
Функция ПолучитьНаименованиеСтдКомм()
Возврат(СокрЛП(СтандартныйКомментарий.Наименование));
КонецФункции

&НаКлиенте
Процедура ОК(Команда)
	Если ЗначениеЗаполнено(СтандартныйКомментарий) Тогда
		Если ПолучитьНаименованиеСтдКомм() = "Прочее" Тогда
			Если Не ЗначениеЗаполнено(Комментарий) Тогда
			Сообщить("Введите расширенный комментарий к ремонту.");
			Возврат;
			КонецЕсли; 	
		КонецЕсли;
	Иначе
	Сообщить("Выберите стандартный комментарий к ремонту.");
	Возврат;	
	КонецЕсли;  
Парам = Новый Структура("СтандартныйКомментарий,Комментарий",СтандартныйКомментарий,Комментарий);
ЭтаФорма.Закрыть(Парам);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
РабочееМесто = Параметры.РабочееМесто;
	Если Параметры.Свойство("ПричинаОтправкиВБрак") Тогда
	СтандартныйКомментарий = Параметры.ПричинаОтправкиВБрак;
	Иначе	
	Запрос = Новый Запрос;

	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КомментарииНеисправностейТабличнаяЧасть.Ссылка
		|ИЗ
		|	Справочник.КомментарииНеисправностей.ТабличнаяЧасть КАК КомментарииНеисправностейТабличнаяЧасть
		|ГДЕ
		|	КомментарииНеисправностейТабличнаяЧасть.РабочееМесто = &РабочееМесто
		|	И КомментарииНеисправностейТабличнаяЧасть.Ссылка.ИспользоватьПоУмолчанию = ИСТИНА";
	Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтандартныйКомментарий = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СтандартныйКомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
Ф = ПолучитьФорму("Справочник.КомментарииНеисправностей.ФормаВыбора");
Ф.Список.Параметры.УстановитьЗначениеПараметра("РабочееМесто",РабочееМесто);
Результат = Ф.ОткрытьМодально();
	Если Результат <> Неопределено Тогда
	СтандартныйКомментарий = Результат;
	КонецЕсли; 
КонецПроцедуры
